---
type: ModuleSettings
namespace: Autodesk.Revit.DB.Macros
version: 2024
members: 6
tags: [revit-api, class]
---

# ModuleSettings

`Autodesk.Revit.DB.Macros.ModuleSettings` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ModuleSettings | 2014 | `public ModuleSettings ( string name , MacroLanguageType macroLanguageType )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Description | 2014 | `public string Description { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MacroLanguageType | 2014 | `public MacroLanguageType MacroLanguageType { get ; set ; }` |
| Property | Name | 2014 | `public string Name { get ; set ; }` |